<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [118]:
import pandas as pd
import psycopg2
import sqlalchemy

In [119]:
f = 'connect.yaml' # файл с параметрами подключения
d = {k:v.strip() for k, v in (l.split(':') for l in open(f))} # считывание параметров из файла
conn_str = f"postgresql+psycopg2://{d['user']}:{d['password']}@{d['host']}:{d['port']}/{d['dbname']}" # строка для подключения к БД

In [120]:
connection = psycopg2.connect(
   dbname=DBNAME,
   user=USER,
   host=HOST,
   password=PASSWORD,
   port=PORT
) # подключение к БД с явным указанием параметров (применено для юнита 6, т.к. метод с чтением параметров из файла вызывал ошибку)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [121]:
# текст запроса
query_3_1 = f'''select
                    count(*) "Количество вакансий в БД"
                from public.vacancies
             '''

In [122]:
# результат запроса
df_vac = pd.read_sql_query(query_3_1, conn_str)
display(df_vac)

   Количество вакансий в БД
0                     49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [123]:
# текст запроса
query_3_2 = f'''select
                    count(*) "Количество работодателей в БД"
                from public.employers
             '''

In [124]:
# результат запроса
df_emp = pd.read_sql_query(query_3_2, conn_str)
display(df_emp)

   Количество работодателей в БД
0                          23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [125]:
# текст запроса
query_3_3 = f'''select
                    count(*) "Количество регионов в БД"
                from public.areas
             '''

In [126]:
# результат запроса
df_reg = pd.read_sql_query(query_3_3, conn_str)
display(df_reg)

   Количество регионов в БД
0                      1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [127]:
# текст запроса
query_3_4 = f'''select
                    count(*) "Количество сфер деятельности в БД"
                from public.industries
             '''

In [128]:
# результат запроса
df_ind = pd.read_sql_query(query_3_4, conn_str)
display(df_ind)

   Количество сфер деятельности в БД
0                                294

***

In [129]:
display(f"Среднее количество вакансий на 1 работодателя: {round((df_vac.iloc[0, 0] / df_emp.iloc[0, 0]), 2)}")
display(f"Среднее количество вакансий на 1 регион: {round((df_vac.iloc[0, 0] / df_reg.iloc[0, 0]), 2)}")
display(f"Среднее количество вакансий на 1 cферу деятельности: {round((df_vac.iloc[0, 0] / df_ind.iloc[0, 0]), 2)}")

'Среднее количество вакансий на 1 работодателя: 2.09'

'Среднее количество вакансий на 1 регион: 36.12'

'Среднее количество вакансий на 1 cферу деятельности: 167.34'

Выводы:

В БД содержится достаточное количество вакансий для анализа. Количество вакансий превышает количество работодателей более чем в 2 раза. В среднем на регион и сферу деятельности работодателя приходится по 36 и 167 вакансий соответственно, что позволяет проводить дельнейший анализ по отдельным критериям.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [130]:
# текст запроса
query_4_1 = f'''select
                    a.name area,
                    count(*) cnt
                from public.vacancies v
                join public.areas a on v.area_id = a.id /*соединение таблиц vacancies и areas по id региона*/
                group by area /*группировка по названию региона*/
                order by cnt desc /*сортировка по убыванию количества вакансий*/
                limit 5
             '''

In [131]:
# результат запроса
df = pd.read_sql_query(query_4_1, conn_str)
display(df)

              area   cnt
0           Москва  5333
1  Санкт-Петербург  2851
2            Минск  2112
3      Новосибирск  2006
4           Алматы  1892

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [132]:
# текст запроса
query_4_2 = f'''select
                    count(*) "Количество вакансий с з/п"
                from public.vacancies
                where salary_from is not null or salary_to is not null /*условие наличия указанного значения зарплаты*/
             '''

In [133]:
# результат запроса
df = pd.read_sql_query(query_4_2, conn_str)
display(df)

   Количество вакансий с з/п
0                      24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [134]:
# текст запроса
query_4_3 = f'''select
                    round(avg(salary_from)) "Средняя з/п от",
                    round(avg(salary_to)) "Средняя з/п до"
                from public.vacancies
             '''

In [135]:
# результат запроса
df = pd.read_sql_query(query_4_3, conn_str)
display(df)

   Средняя з/п от  Средняя з/п до
0         71065.0        110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [136]:
# текст запроса
query_4_4 = f'''select
                    schedule "Тип рабочего графика",
                    employment "Тип трудоустройства",
                    count(*) "Количество вакансий"
                from public.vacancies
                group by schedule, employment /*группировка по типам графика и трудоустройства*/
                order by 3 desc /*сортировка по убыванию количества вакансий*/
                offset 1
                limit 1
             '''

In [137]:
# результат запроса
df = pd.read_sql_query(query_4_4, conn_str)
display(df)

  Тип рабочего графика Тип трудоустройства  Количество вакансий
0     Удаленная работа    Полная занятость                 7802

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [138]:
# текст запроса
query_4_5 = f'''select
                    experience "Требуемый опыт",
                    count(*) "Количество вакансий"
                from public.vacancies
                group by experience /*группировка по опыту работы*/
                order by 2 /*сортировка по возрастанию количества вакансий*/
             '''

In [139]:
# результат запроса
df = pd.read_sql_query(query_4_5, conn_str)
display(df)

       Требуемый опыт  Количество вакансий
0         Более 6 лет                 1337
1           Нет опыта                 7197
2       От 3 до 6 лет                14511
3  От 1 года до 3 лет                26152

***

Выводы:

- Наибольшее количество вакансий представлено в столицах и городах-миллионниках, что вполне логично.
- Для более чем половины вакансий в БД не указан размер заработной платы, что может быть связано с желанием работодателя определить уровень заработной платы соискателя по результатам собеседования. Средняя же з/п для вакансий с указанием такой информации колеблется от 71 до 110 тысяч рублей.
- Вакансии с полной занятостью составляют бОльшую часть предложений работодателей. Наиболее распространенным типом рабочего графика является "Полный день". Примерно каждая пятая вакансия подразумевает удаленный режим работы.
- Более 80% вакансий содержат требования по опыту работы от 1 года до 6 лет.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [140]:
# текст запроса
query_5_1 = f'''(select
                    e.name "Работодатель",
                    count(*) "Количество вакансий"
                from public.employers e
                join public.vacancies v on e.id = v.employer_id /*соединение таблиц employers и vacancies по id работодателя*/
                group by e.name /*группировка по названию работодателя*/
                order by 2 desc
                limit 1)
    
                union all /*объединение результатов двух запросов*/

                (select
                    e.name,
                    count(*)
                from public.employers e
                join public.vacancies v on e.id = v.employer_id
                group by e.name
                order by 2 desc
                offset 4
                limit 1)
             '''

In [141]:
# результат запроса
df = pd.read_sql_query(query_5_1, conn_str)
display(df)

    Работодатель  Количество вакансий
0         Яндекс                 1933
1  Газпром нефть                  331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [142]:
# текст запроса
query_5_2 = f'''select 
                    a.name "Регион",
                    count(distinct e.id) "Количество работодателей",
                    count(distinct v.id) "Количество вакансий"
                from public.areas a
                left join public.employers e on a.id = e.area /*присоединение к таблице areas таблицы employers по id региона*/
                left join public.vacancies v on a.id = v.area_id /*присоединение таблицы вакансий по id региона*/
                group by a.id /*группировка по id региона*/
                having count(v.id) = 0 /*условие отсутствия вакансий в регионе*/
                order by 2 desc
                limit 1
             '''

In [143]:
# результат запроса
df = pd.read_sql_query(query_5_2, conn_str)
display(df)

   Регион  Количество работодателей  Количество вакансий
0  Россия                       410                    0

        Дополнительное исследование: лидеры по количеству работодателей и вакансий

In [182]:
# текст запроса
query_5_2_add = f'''select 
                        a.name "Регион",
                        count(distinct e.id) "Количество работодателей",
                        count(distinct v.id) "Количество вакансий"
                    from public.areas a
                    left join public.employers e on a.id = e.area /*присоединение к таблице areas таблицы employers по id региона*/
                    left join public.vacancies v on a.id = v.area_id /*присоединение таблицы вакансий по id региона*/
                    group by a.id /*группировка по id региона*/
                    order by 2 desc
                    limit 5
                 '''

In [183]:
# результат запроса
df = pd.read_sql_query(query_5_2_add, conn_str)
display(df)

            Регион  Количество работодателей  Количество вакансий
0           Москва                      5864                 5333
1  Санкт-Петербург                      2217                 2851
2            Минск                      1115                 2112
3           Алматы                       721                 1892
4     Екатеринбург                       609                 1698

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [144]:
# текст запроса
query_5_3 = f'''select
                    e.name "Работодатель",
                    count(distinct v.area_id) "Количество регионов с вакансиями"
                from public.employers e
                join public.vacancies v on e.id = v.employer_id /*соединение таблиц employers и vacancies по id работодателя*/
                group by e.name /*группировка по названию работодателя*/
                order by 2 desc
             '''

In [145]:
# результат запроса
df = pd.read_sql_query(query_5_3, conn_str)
display(df)

                 Работодатель  Количество регионов с вакансиями
0                      Яндекс                               181
1                  Ростелеком                               152
2                  Спецремонт                               116
3      Поляков Денис Иванович                                88
4                   ООО ЕФИН                                 71
...                       ...                               ...
14761                  UniSol                                 1
14762            UNISTORY LLC                                 1
14763                   UNIT6                                 1
14764     United Distribution                                 1
14765              UNITEL LLC                                 1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [146]:
# текст запроса
query_5_4 = f'''select
                    count(e.id) "Количество работодателей"
                from public.employers e
                left join public.employers_industries ei on e.id = ei.employer_id /*присоединение к таблице employers таблицы employers_industries по id работодателя*/
                where ei.industry_id is null /*условие отсутствия у работодателя записи о сфере деятельности*/
             '''

In [185]:
# результат запроса
df = pd.read_sql_query(query_5_4, conn_str)
display(df)
display(f"Работодателей от общего количества в БД: {round((df.iloc[0, 0] / df_emp.iloc[0, 0]) * 100, 1)}%")

   Количество работодателей
0                      8419

'Работодателей от общего количества в БД: 35.8%'

        Дополнительное исследование: количество вакансий у работодателей без указания сферы деятельности

In [148]:
# текст запроса
query_5_4_add = f'''select
                        count(v.id) "Количество вакансий"
                    from public.employers e
                    join public.vacancies v on e.id = v.employer_id /*соединение таблиц employers и vacancies по id работодателя*/
                    left join public.employers_industries ei on e.id = ei.employer_id /*присоединение таблицы employers_industries по id работодателя*/
                    where ei.industry_id is null /*условие отсутствия у работодателя записи о сфере деятельности*/
                 '''

In [149]:
# результат запроса
df = pd.read_sql_query(query_5_4_add, conn_str)
display(df)
display(f"Вакансий от общего количества в БД: {round((df.iloc[0, 0] / df_vac.iloc[0, 0]) * 100, 1)}%")

   Количество вакансий
0                10084

'Вакансий от общего количества в БД: 20.5%'

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [150]:
# текст запроса
query_5_5 = f'''select
                    e.name "Работодатель"
                from public.employers e
                join public.employers_industries ei on e.id = ei.employer_id /*соединение таблиц employers и employers_industries по id работодателя*/
                group by e.name /*группировка по названию работодателя*/
                having count(ei.industry_id) = 4 /*условие по количеству сфер деятельности*/
                order by 1
                offset 2
                limit 1
             '''

In [151]:
# результат запроса
df = pd.read_sql_query(query_5_5, conn_str)
display(df)

  Работодатель
0         2ГИС

        Дополнительное исследование: лидеры по количеству сфер деятельности

In [152]:
# текст запроса
query_5_5_add = f'''select
                        e.name "Работодатель",
                        count(ei.industry_id) "Количество сфер деятельности"
                    from public.employers e
                    join public.employers_industries ei on e.id = ei.employer_id /*соединение таблиц employers и employers_industries по id работодателя*/
                    group by e.name /*группировка по названию работодателя*/
                    order by 2 desc, 1
                 '''

In [153]:
# результат запроса
df = pd.read_sql_query(query_5_5_add, conn_str)
display(df)

                         Работодатель  Количество сфер деятельности
0                              Модуль                            16
1                     Простые решения                            11
2                               Прайд                            10
3                             Энергия                            10
4                               Альфа                             9
...                               ...                           ...
14951              Яркий кадр, Студия                             1
14952                Яркий фотомаркет                             1
14953  Ярославский завод Красный Маяк                             1
14954                       Яр, отель                             1
14955            Яроцкий Е. В./ MoonX                             1

[14956 rows x 2 columns]

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [154]:
# текст запроса
query_5_6 = f'''select
                    count(*) "Количество работодателей"
                from public.employers_industries ei
                join public.employers e on ei.employer_id = e.id /*соединение таблиц employers_industries и employers по id работодателя*/
                join public.industries i on ei.industry_id = i.id /*присоединение таблицы industries по id сферы деятельности*/
                where i.name = 'Разработка программного обеспечения' /*условие по наименованию сферы деятельности*/
             '''

In [155]:
# результат запроса
df = pd.read_sql_query(query_5_6, conn_str)
display(df)

   Количество работодателей
0                      3553

        Дополнительное исследование: наиболее популярные сферы деятельности среди работодателей

In [156]:
# текст запроса
query_5_6_add = f'''select
                        i.name "Сфера деятельности",
                        count(*) "Количество работодателей"
                    from public.employers_industries ei
                    join public.employers e on ei.employer_id = e.id /*соединение таблиц employers_industries и employers по id работодателя*/
                    join public.industries i on ei.industry_id = i.id /*присоединение таблицы industries по id сферы деятельности*/
                    group by i.name /*группировка по сфере деятельности*/
                    order by 2 desc
                    limit 5
                 '''

In [157]:
# результат запроса
df = pd.read_sql_query(query_5_6_add, conn_str)
display(df)

                                  Сфера деятельности  Количество работодателей
0                Разработка программного обеспечения                      3553
1  Системная интеграция,  автоматизации технологи...                      2993
2  Интернет-компания (поисковики, платежные систе...                      1675
3  Маркетинговые, рекламные, BTL, дизайнерские, E...                       798
4                              Консалтинговые услуги                       662

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [158]:
# код для получения списка городов-милионников
url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
tables = pd.read_html(url) ## чтение HTML-таблиц в список из DataFrame
display(tables)

[    0                                                  1
 0 NaN  Информация в этой статье или некоторых её разд...,
      №            Город Население, тыс. чел.  (на 1 января 2023 года)
 0    1           Москва                                        13 098  \
 1    2  Санкт-Петербург                                         5 598
 2    3      Новосибирск                                         1 635
 3    4     Екатеринбург                                         1 539
 4    5           Казань                                         1 315
 5    6  Нижний Новгород                                           NaN
 6    7       Красноярск                                         1 197
 7    8        Челябинск                                         1 183
 8    9           Самара                                           NaN
 9   10              Уфа                                           NaN
 10  11   Ростов-на-Дону                                           NaN
 11  12             Омск                                           NaN
 12  13        Краснодар                                         1 121
 13  14       Воронеж[a]                                           NaN
 14  15            Пермь                                         1 027
 15  16        Волгоград                                         1 026

    Население, тыс. чел.  (итоги переписи  2021 года)[5]
 0                                              13 010    \
 1                                               5 602
 2                                               1 634
 3                                               1 544
 4                                               1 309
 5                                               1 226
 6                                               1 188
 7                                               1 190
 8                                               1 173
 9                                               1 145
 10                                              1 142
 11                                              1 126
 12                                              1 099
 13                                              1 058
 14                                              1 034
 15                                              1 028

    Прирост  относительно  переписи-2010
 0                                 13,1%  \
 1                                 14,8%
 2                                 10,9%
 3                                 14,4%
 4                                 14,4%
 5                                   NaN
 6                                 21,6%
 7                                  5,3%
 8                                  0,3%
 9                                  7,8%
 10                                 4,9%
 11                                  NaN
 12                                43,8%
 13                                18,9%
 14                                 4,3%
 15                                 0,7%

    Население, тыс. чел. (итоги переписи  2010 года)[6]
 0                                              11 504
 1                                               4 880
 2                                               1 474
 3                                               1 350
 4                                               1 144
 5                                               1 251
 6                                                 977
 7                                               1 130
 8                                               1 169
 9                                               1 062
 10                                              1 089
 11                                              1 166
 12                                                764
 13                                                890
 14                                                991
 15                                              1 021   ,
    Место    Город  Население, тыс. чел. (перепись-2021)[5]
 0     17  Саратов                                      901  \
 1     18   Тюмень                                      847

   Прирост относительно переписи-2010  Население, тыс. чел. (перепись-2010)[6]
 0                              7,5 %                                      838
 1                             45,5 %                                      582  ,
                 Место                                              Город
    Unnamed: 0_level_1      Города-мультимиллионеры (свыше 2 млн жителей)
 0                 1.0                                             Москва  \
 1                 2.0                                    Санкт-Петербург
 2                 NaN                Города-миллионеры (1—2 млн жителей)
 3                 3.0                                        Новосибирск
 4                 4.0                                       Екатеринбург
 5                 5.0                                             Казань
 6                 6.0                                    Нижний Новгород
 7                 7.0                                          Челябинск
 8                 8.0                                         Красноярск
 9                 9.0                                             Самара
 10               10.0                                                Уфа
 11               11.0                                     Ростов-на-Дону
 12               12.0                                               Омск
 13               13.0                                          Краснодар
 14               14.0                                            Воронеж
 15               15.0                                              Пермь
 16               16.0                                          Волгоград
 17                NaN        Города-субмиллионеры (800—999 тыс. жителей)
 18               17.0                                            Саратов
 19               18.0                                             Тюмень
 20                NaN    Итого численность населения крупнейших городов:
 21                NaN  Доля численности населения крупнейших городов ...
 22                NaN  Доля численности населения крупнейших городов ...

    Год достижения численности 1 млн жителей
                          Unnamed: 2_level_1
 0                                      1897  \
 1      1890 (до 1919), 1922 (до 1943), 1945
 2                                       NaN
 3                                      1962
 4                                      1967
 5                                      1979
 6                                      1962
 7                                      1976
 8                                      2012
 9                                      1967
 10                                     1980
 11                                     1987
 12                                     1978
 13                                  2018[b]
 14                                     2012
 15                     1979 (до 2004), 2011
 16     1989 (до 1999), 2002 (до 2005), 2010
 17                                      NaN
 18                                        —
 19                                        —
 20                                        —
 21                                        —
 22                                        —

    Население, тыс. чел. (перепись-2021)[5]     Экономический район
                         Unnamed: 3_level_1      Unnamed: 4_level_1
 0                                   13 010             Центральный  \
 1                                     5602         Северо-Западный
 2                                      NaN                     NaN
 3                                     1634       Западно-Сибирский
 4                                     1544               Уральский
 5                                     1309              Поволжский
 6                                     1226           Волго-Вятский
 7                                     1190               Уральский
 8                                     1188      Восточно-Сибирский
 9                                     1173              Поволжский
 10                                    1145               Уральский
 11                                    1142       Северо-Кавказский
 12                                    1126       Западно-Сибирский
 13                                    1099       Северо-Кавказский
 14                                    1058  Центрально-Чернозёмный
 15                                    1034               Уральский
 16                                    1028              Поволжский
 17                                     NaN                     NaN
 18                                     901              Поволжский
 19                                     847       Западно-Сибирский
 20                                  37 256                     NaN
 21                                 25,31 %                     NaN
 22                                 33,85 %                     NaN

     Федеральный округ
    Unnamed: 5_level_1
 0         Центральный
 1     Северо-Западный
 2                 NaN
 3           Сибирский
 4           Уральский
 5         Приволжский
 6         Приволжский
 7           Уральский
 8           Сибирский
 9         Приволжский
 10        Приволжский
 11              Южный
 12          Сибирский
 13              Южный
 14        Центральный
 15        Приволжский
 16              Южный
 17                NaN
 18        Приволжский
 19          Уральский
 20                NaN
 21                NaN
 22                NaN  ,
     Место                              Агломерация
 0       1                               Московская  \
 1       2                      Санкт-Петербургская
 2       3                Самарско-Тольяттинская[d]
 3       4                         Екатеринбургская
 4       5                            Нижегородская
 5       6                               Ростовская
 6       7                            Новосибирская
 7    8—10                            Волгоградская
 8    8—10                                Казанская
 9    8—10                              Челябинская
 10     11                                   Омская
 11  12—14                            Краснодарская
 12  12—14                                 Уфимская
 13  12—14           Новокузнецкая (Кузбасская)*[d]
 14  15—18                             Красноярская
 15  15—18                                 Пермская
 16  15—18                             Саратовская*
 17  15—18                              Воронежская
 18  19—22    Иркутская (Иркутско-Черемховская)*[d]
 19  19—22  Набережночелнинская (Нижне-Камская)*[d]
 20  19—22                      Владивостокская*[d]
 21  19—22               Тульско-Новомосковская*[d]
 22     23                  Ульяновская агломерация

    Население, урбанизированное/субурбанизированное-тяготеющее, тыс. чел. (2010)[9]
 0                           16 023 (14 700[c])/17 316
 1                                 5681 (5400[c])/6230
 2                               2300[c]; 2555/3170[e]
 3                                           2054/2054
 4                                           1928/2097
 5                                  1714/2096; 2570[f]
 6              1736/(1928) 1997; 1645/2070; 1887/2050
 7                                           1416/1517
 8                                           1352/1560
 9                                           1322/1535
 10                                          1182/1261
 11                                          1046/1344
 12                                          1087/1235
 13                                          1096/1206
 14                                          1061/1155
 15                                          1044/1144
 16                                          1070/1117
 17                                          1015/1360
 18                                          1041/1081
 19                                       1010/1125[c]
 20                              1010[c]; 1125/1199[g]
 21                                            1030[c]
 22                                            1008[c]                               ,
     0                                                  1
 0 NaN  В разделе не хватает ссылок на источники (см. ...,
     0                                                  1
 0 NaN  В разделе не хватает ссылок на источники (см. ...,
       1764[10]    1765[11]    1780[11]    1789[11]    1800[10]    1811[11]
 0      149 700    ↗150 300    ↗174 800    ↗217 900    ↗220 200    ↗335 600  \
 1     1825[11]    1833[11]    1837[11]    1840[11]    1850[10]    1852[11]
 2     ↗424 700    ↗442 900    ↗468 800    ↗470 200    ↗487 300    ↗532 200
 3     1870[11]    1882[11]    1891[11]    1897[12]    1900[10]    1901[11]
 4     ↗668 000    ↗928 000  ↗1 033 600  ↗1 264 920  ↗1 418 000  ↗1 439 600
 5     1914[11]    1915[10]    1916[10]    1917[10]    1918[10]    1919[10]
 6   ↗2 118 500  ↗2 314 500  ↗2 415 700  ↘2 300 000  ↘1 469 000    ↘900 000
 7     1921[10]    1922[10]    1923[10]    1924[10]    1925[10]    1926[13]
 8     ↗830 000    ↗960 000  ↗1 093 000  ↗1 221 000  ↗1 379 000  ↗1 560 122
 9     1930[10]    1931[15]    1935[10]    1937[13]    1939[16]    1940[10]
 10  ↗2 009 500  ↗2 236 515  ↗2 715 700  ↗2 814 474  ↗3 191 304  ↘2 920 000
 11    1942[10]    1943[10]    1944[10]    1945[10]    1946[10]    1947[10]
 12  ↘2 432 000    ↘622 000    ↘546 000    ↗927 000  ↗1 541 000  ↗1 920 000
 13    1949[10]    1950[10]    1955[10]    1956[17]    1959[18]    1960[10]
 14  ↗2 218 000  ↗2 258 000  ↗2 797 000  ↗2 814 000  ↗3 321 196  ↗3 432 000
 15    1965[10]    1967[11]    1970[19]    1973[11]    1975[20]    1976[11]
 16  ↗3 777 200  ↘3 296 000  ↗3 949 501  ↘3 679 000  ↗4 418 000  ↘3 915 000
 17    1980[10]    1981[10]    1982[10]    1983[10]    1984[10]    1985[10]
 18  ↗4 635 200  ↗4 669 400  ↗4 711 200  ↗4 762 100  ↗4 806 400  ↗4 844 200
 19    1987[10]    1988[10]    1989[22]    1990[23]    1991[23]    1992[23]
 20  ↗4 931 200  ↗4 986 900  ↗5 023 506  ↘5 002 444  ↗5 007 469  ↘4 986 405
 21    1994[23]    1995[23]    1996[23]    1997[23]    1998[23]    1999[23]
 22  ↘4 881 563  ↘4 845 407  ↘4 820 213  ↘4 806 641  ↘4 783 982  ↘4 770 897
 23    2001[23]    2002[24]    2003[23]    2004[23]    2005[23]    2006[23]
 24  ↘4 714 844  ↘4 661 219  ↘4 656 474  ↘4 624 083  ↘4 600 000  ↘4 580 620
 25    2008[23]    2009[23]    2010[25]    2011[23]    2012[26]    2013[27]
 26  ↘4 568 047  ↗4 581 854  ↗4 879 566  ↗4 899 344  ↗4 953 219  ↗5 028 000
 27    2015[29]    2016[30]    2017[31]    2018[32]    2019[33]    2020[34]
 28  ↗5 191 690  ↗5 225 690  ↗5 281 579  ↗5 351 935  ↗5 383 890  ↗5 398 064
 29    2022[36]    2023[37]         NaN         NaN         NaN         NaN
 30  ↗5 607 916  ↘5 598 486         NaN         NaN         NaN         NaN

       1817[11]
 0     ↗363 900
 1     1863[11]
 2     ↗539 500
 3     1910[11]
 4   ↗1 905 600
 5     1920[10]
 6     ↘740 000
 7     1928[14]
 8   ↗1 688 300
 9     1941[10]
 10  ↗2 992 000
 11    1948[10]
 12  ↗1 998 000
 13    1962[11]
 14  ↘3 036 000
 15    1979[21]
 16  ↗4 588 183
 17    1986[10]
 18  ↗4 882 200
 19    1993[23]
 20  ↘4 942 891
 21    2000[23]
 22  ↘4 741 923
 23    2007[23]
 24  ↘4 571 184
 25    2014[28]
 26  ↗5 131 942
 27    2021[35]
 28  ↗5 601 911
 29         NaN
 30         NaN  ,
            1350         1400         1600         1638         1710
 0        30 000      ↗40 000     ↗100 000     ↗200 000     ↘160 000  \
 1          1750         1775     1785[38]         1800     1811[38]
 2      ↘130 000     ↗161 000     ↗188 700     ↗250 000     ↗270 200
 3      1830[38]     1835[38]     1840[38]     1847[38]         1852
 4      ↗305 600     ↗335 800     ↗349 100     ↗353 300     ↗373 800
 5      1859[38]     1863[38]         1864         1868         1871
 6      ↗379 300     ↗462 500     ↘351 600     ↗416 400     ↗601 969
 7          1891     1897[39]         1900     1902[38]     1907[38]
 8      ↗822 400   ↗1 039 000   ↗1 175 000   ↘1 174 700   ↗1 345 700
 9      1913[38]     1914[38]         1915     1917[38]         1920
 10   ↘1 563 100   ↗1 762 700   ↗1 817 000   ↗1 854 400   ↘1 028 200
 11     1928[40]     1931[15]         1936     1937[13]     1939[41]
 12   ↗2 127 200   ↗2 781 340   ↗3 641 500   ↗3 798 078   ↗4 131 633
 13     1943[42]     1945[42]     1956[17]     1959[43]     1963[44]
 14   ↗2 743 600   ↗3 361 000   ↗4 839 000   ↗5 045 905   ↗6 354 000
 15     1972[38]     1973[38]     1975[20]     1976[46]     1979[47]
 16   ↗7 151 000   ↗7 255 000   ↗7 862 000   ↘7 734 000   ↗7 830 509
 17     1986[38]     1987[50]     1989[51]     1990[23]     1991[23]
 18   ↘8 527 000   ↗8 815 000   ↘8 769 117   ↗8 880 124   ↗9 017 415
 19     1994[23]     1995[23]     1996[23]     1997[23]     1998[23]
 20   ↗9 066 612   ↗9 085 457   ↗9 246 727   ↗9 411 236   ↗9 604 297
 21     2001[23]     2002[24]     2003[23]     2004[23]     2005[23]
 22  ↗10 114 203  ↗10 382 754  ↗10 386 903  ↗10 535 681  ↗10 726 429
 23     2008[23]     2009[23]     2010[25]     2011[23]     2012[23]
 24  ↗11 186 851  ↗11 281 631  ↗11 503 501  ↗11 776 764  ↗11 856 578
 25     2015[29]     2016[30]     2017[31]     2018[32]     2019[33]
 26  ↗12 197 596  ↗12 330 126  ↗12 380 664  ↗12 506 468  ↗12 615 279
 27     2022[36]     2023[37]          NaN          NaN          NaN
 28  ↗13 015 126  ↗13 097 539          NaN          NaN          NaN

            1725         1738
 0      ↘145 000     ↘138 400
 1          1813     1825[38]
 2      ↘215 000     ↗241 500
 3      1856[38]     1858[38]
 4      ↘368 800     ↗377 800
 5      1882[38]         1886
 6      ↗753 500     ↘753 459
 7          1908         1912
 8    ↗1 359 200   ↗1 617 157
 9      1923[38]     1926[13]
 10   ↗1 542 900   ↗1 995 252
 11     1941[42]     1942[42]
 12   ↗4 345 400   ↘2 361 500
 13     1967[38]     1970[45]
 14   ↗6 422 000   ↗6 941 961
 15     1982[48]     1985[49]
 16   ↗8 111 000   ↗8 652 000
 17     1992[23]     1993[23]
 18   ↗9 067 808   ↘9 066 025
 19     1999[23]     2000[23]
 20   ↗9 783 242   ↗9 932 932
 21     2006[23]     2007[23]
 22  ↗10 923 762  ↗11 091 428
 23     2013[27]     2014[28]
 24  ↗11 979 529  ↗12 108 257
 25     2020[34]     2021[35]
 26  ↗12 678 079  ↗13 010 112
 27          NaN          NaN
 28          NaN          NaN  ,
                                        Города России  Города России.1
 0  Список городов России с населением более 1 млн...              NaN,
                             Города-миллионеры России
 0  1 Москва 2 Санкт-Петербург 3 Новосибирск 4 Ека...  \
 1  Порядковые места распределены по численности н...

                           Города-миллионеры России.1
 0                                                NaN
 1  Порядковые места распределены по численности н...  ,
              Городские агломерации-миллионеры России
 0  Московская Санкт-Петербургская Самарско-Тольят...  \

    Городские агломерации-миллионеры России.1
 0                                        NaN  ]

In [159]:
cities = tuple(tables[1].replace({'Город': {'Воронеж[a]': 'Воронеж'}})['Город'].values) # преобразование списка в кортеж
display(cities)

('Москва',
 'Санкт-Петербург',
 'Новосибирск',
 'Екатеринбург',
 'Казань',
 'Нижний Новгород',
 'Красноярск',
 'Челябинск',
 'Самара',
 'Уфа',
 'Ростов-на-Дону',
 'Омск',
 'Краснодар',
 'Воронеж',
 'Пермь',
 'Волгоград')

In [160]:
# текст запроса
query_5_7 = f'''(select 
                    a.name "Город",
                    count(*) "Количество вакансий"
                from public.vacancies v
                join public.employers e on e.id = v.employer_id /*соединение таблиц vacancies и employers по id работодателя*/
                join public.areas a on a.id = v.area_id /*присоединение таблицы areas по id региона*/
                where e.name = 'Яндекс' and a.name in {cities} /*условие по наименованию работодателя и перечню городов-миллионников*/
                group by a.name /*группировка по названию города*/
                )

                union all /*объединение результатов двух запросов*/

                (select 
                    'Total',
                    count(*)
                from public.vacancies v
                join public.employers e on e.id = v.employer_id
                join public.areas a on a.id = v.area_id
                where e.name = 'Яндекс' and a.name in {cities}
                )

                order by 2 /*сортировка итоговой таблицы*/
             '''

In [161]:
# результат запроса
df = pd.read_sql_query(query_5_7, conn_str)
display(df)
display(f"Количество строк в таблице: {df.shape[0]}")

              Город  Количество вакансий
0              Омск                   21
1         Челябинск                   22
2        Красноярск                   23
3         Волгоград                   24
4             Пермь                   25
5            Казань                   25
6    Ростов-на-Дону                   25
7               Уфа                   26
8            Самара                   26
9         Краснодар                   30
10          Воронеж                   32
11      Новосибирск                   35
12  Нижний Новгород                   36
13     Екатеринбург                   39
14  Санкт-Петербург                   42
15           Москва                   54
16            Total                  485

'Количество строк в таблице: 17'

***

Выводы:

- Лидером по количеству вакансий в БД с большим отрывом является Яндекс - 1933 вакансий. Ростелеком, занимающий 2-е место, имеет почти в 4 раза меньше вакансий.
- Лидерами по количеству работодателей и вакансий являются Москва, Санкт-Петербург и Минск. Часть работодателей точно не указывает свое местонахождение, органичиваясь указанием региона или страны, при этом в вакансиях всегда точно указан населенный пункт. Это объясняет нулевое количество вакансий в части регионов, где есть зарегистрированные работодатели.
- Яндекс и Ростелеком являются лидерами по количеству регионов с опубликованными в них вакансиями.
- Более 35% работодателей в БД не указывают свою сферу деятельности. На долю таких работодателей приходится 10084 вакансий, что составляет чуть более 20% всех вакансий в БД (см. доп. исследование).
- Лидером по количеству сфер деятельности является компания "Модуль", указавшая 16 различных областей (см. доп. исследование).
- Разработка программного обеспечения является наиболее распространенной сферой деятельности среди работодателей в БД (см. доп. исследование).
- 25% вакансий Яндекса приходится на города-миллионники.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [197]:
# текст запроса
query_6_1 = f'''select
                    count(*) "Количество вакансий"
                from public.vacancies
                where lower(name) like '%data%' or lower(name) like '%данн%' /*условие по принадлежности вакансии к данным*/
             '''

In [200]:
# результат запроса
df = pd.read_sql_query(query_6_1, connection)
display(df)
display(f"Вакансий от общего количества в БД: {round((df.iloc[0, 0] / df_vac.iloc[0, 0]) * 100, 1)}%")

C:\Users\kkaza\AppData\Local\Temp\ipykernel_1796\4105223737.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   Количество вакансий
0                 1771

'Вакансий от общего количества в БД: 3.6%'

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [164]:
# текст запроса
query_6_2 = f'''select 
                    count(*) "Количество вакансий"
                from public.vacancies
                where
                    (name ilike '%data scientist%' 
                    or name ilike '%data science%'
                    or name ilike '%исследователь данных%'
                    or (name like '%ML%' and name not like '%HTML%')
                    or name ilike '%machine learning%'
                    or name ilike '%машинн%обучен%%') /*условие по принадлежности вакансии к DS*/
                    and 
                    (name ilike '%junior%'
                    or experience ilike '%Нет опыта%'
                    or employment ilike '%Стажировка%') /*условие по критериям для junior*/
             '''

In [165]:
# результат запроса
df = pd.read_sql_query(query_6_2, connection)
display(df)

C:\Users\kkaza\AppData\Local\Temp\ipykernel_1796\700150659.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   Количество вакансий
0                   51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [166]:
# текст запроса
query_6_3 = f'''select 
                    count(*) "Количество вакансий"
                from public.vacancies
                where
                    (name ilike '%data scientist%' 
                    or name ilike '%data science%'
                    or name ilike '%исследователь данных%'
                    or (name like '%ML%' and name not like '%HTML%')
                    or name ilike '%machine learning%'
                    or name ilike '%машинн%обучен%%') /*условие по принадлежности вакансии к DS*/
                    and 
                    (key_skills ilike '%SQL%'
                    or key_skills ilike '%postgres%') /*условие по ключевым навыкам*/
             '''

In [167]:
# результат запроса
df = pd.read_sql_query(query_6_3, connection)
display(df)

C:\Users\kkaza\AppData\Local\Temp\ipykernel_1796\1206811184.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   Количество вакансий
0                  201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [168]:
# текст запроса
query_6_4 = f'''select 
                    count(*) "Количество вакансий"
                from public.vacancies
                where
                    (name ilike '%data scientist%' 
                    or name ilike '%data science%'
                    or name ilike '%исследователь данных%'
                    or (name like '%ML%' and name not like '%HTML%')
                    or name ilike '%machine learning%'
                    or name ilike '%машинн%обучен%%') /*условие по принадлежности вакансии к DS*/
                    and
                    key_skills ilike '%Python%' /*условие по ключевому навыку*/
             '''

In [169]:
# результат запроса
df = pd.read_sql_query(query_6_4, connection)
display(df)

C:\Users\kkaza\AppData\Local\Temp\ipykernel_1796\4143830933.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   Количество вакансий
0                  351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [170]:
# текст запроса
query_6_5 = f'''select 
                    round(avg(length(key_skills) - length(replace(key_skills, CHR(9), '')) + 1), 2) "Количество ключевых навыков"
                from public.vacancies
                where
                    (name ilike '%data scientist%' 
                    or name ilike '%data science%'
                    or name ilike '%исследователь данных%'
                    or (name like '%ML%' and name not like '%HTML%')
                    or name ilike '%machine learning%'
                    or name ilike '%машинн%обучен%%') /*условие по принадлежности вакансии к DS*/
                    and
                    key_skills is not null /*условие наличию ключевых навыков*/
             '''

In [171]:
# результат запроса
df = pd.read_sql_query(query_6_5, connection)
display(df)

C:\Users\kkaza\AppData\Local\Temp\ipykernel_1796\3940953658.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   Количество ключевых навыков
0                         6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [172]:
# текст запроса
query_6_6 = f'''select 
                    distinct experience "Опыт работы",
                    round(avg(coalesce((salary_from+salary_to)/2, salary_from, salary_to))) "Средняя з/п"
                from public.vacancies
                where
                    (name ilike '%data scientist%' 
                    or name ilike '%data science%'
                    or name ilike '%исследователь данных%'
                    or (name like '%ML%' and name not like '%HTML%')
                    or name ilike '%machine learning%'
                    or name ilike '%машинн%обучен%%') /*условие по принадлежности вакансии к DS*/
                    and 
                    (salary_from is not null or salary_to is not null) /*условие по наличию указаанной зарплаты*/
                    and 
                    experience = 'От 3 до 6 лет' /*условие по опыту работы*/
                group by 1
             '''

In [173]:
# результат запроса
df = pd.read_sql_query(query_6_6, connection)
display(df)

C:\Users\kkaza\AppData\Local\Temp\ipykernel_1796\3373444971.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

     Опыт работы  Средняя з/п
0  От 3 до 6 лет     243115.0

        Дополнительное исследование: распределение вакансий DS по опыту работы и з/п

In [186]:
query_6_6_1 = f'''select 
                    count(*) "Кол-во вакансий DS с указанной з/п"
                    from public.vacancies
                  where
                    (name ilike '%data scientist%' 
                    or name ilike '%data science%'
                    or name ilike '%исследователь данных%'
                    or (name like '%ML%' and name not like '%HTML%')
                    or name ilike '%machine learning%'
                    or name ilike '%машинн%обучен%%') /*условие по принадлежности вакансии к DS*/
                    and 
                    (salary_from is not null or salary_to is not null) /*условие по наличию указаанной зарплаты*/
               '''

In [187]:
# результат запроса
df = pd.read_sql_query(query_6_6_1, connection)
display(df)

C:\Users\kkaza\AppData\Local\Temp\ipykernel_1796\198901364.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6_1, connection)

   Кол-во вакансий DS с указанной з/п
0                                  62

In [188]:
query_6_6_2 = f'''select
                    distinct experience "Опыт работы",
                    round(avg(coalesce((salary_from+salary_to)/2, salary_from, salary_to))) "Средняя з/п",
                    count(*) "Кол-во вакансий DS с указанной з/п"
                  from public.vacancies
                  where
                    (name ilike '%data scientist%' 
                    or name ilike '%data science%'
                    or name ilike '%исследователь данных%'
                    or (name like '%ML%' and name not like '%HTML%')
                    or name ilike '%machine learning%'
                    or name ilike '%машинн%обучен%%') /*условие по принадлежности вакансии к DS*/
                    and 
                    (salary_from is not null or salary_to is not null) /*условие по наличию указаанной зарплаты*/
                  group by 1
               '''

In [189]:
# результат запроса
df = pd.read_sql_query(query_6_6_2, connection)
display(df)

C:\Users\kkaza\AppData\Local\Temp\ipykernel_1796\410717872.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6_2, connection)

          Опыт работы  Средняя з/п  Кол-во вакансий DS с указанной з/п
0           Нет опыта      74643.0                                   7
1  От 1 года до 3 лет     139675.0                                  28
2       От 3 до 6 лет     243115.0                                  27

In [192]:
query_6_6_3 = f'''(select
                    distinct experience "Опыт работы",
                    count(*) "Количество вакансий DS"
                  from public.vacancies
                  where
                    (name ilike '%data scientist%' 
                    or name ilike '%data science%'
                    or name ilike '%исследователь данных%'
                    or (name like '%ML%' and name not like '%HTML%')
                    or name ilike '%machine learning%'
                    or name ilike '%машинн%обучен%%') /*условие по принадлежности вакансии к DS*/
                  group by 1
                  )
                  
                  union all /*объединение результатов двух запросов*/
                  
                  (select
                    'Итого вакансий DS',
                    count(*)
                  from public.vacancies
                  where
                    (name ilike '%data scientist%' 
                    or name ilike '%data science%'
                    or name ilike '%исследователь данных%'
                    or (name like '%ML%' and name not like '%HTML%')
                    or name ilike '%machine learning%'
                    or name ilike '%машинн%обучен%%')
                  )
                  
                  order by 2 /*сортировка итоговой таблицы*/
               '''

In [193]:
# результат запроса
df = pd.read_sql_query(query_6_6_3, connection)
display(df)

C:\Users\kkaza\AppData\Local\Temp\ipykernel_1796\673847767.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6_3, connection)

          Опыт работы  Количество вакансий DS
0           Нет опыта                      28
1         Более 6 лет                      34
2       От 3 до 6 лет                     195
3  От 1 года до 3 лет                     223
4   Итого вакансий DS                     480

***

Выводы:

- В БД содержится 1771 вакансия, связанная с данными, что составляет 3,6% от общего количества вакансий. Учитывая, что данные в БД не самые свежие, можно преположить, что на текущий момент % таких вакансий на рынке труда выше.
- Общее количество вакансий для DS составляет 480, при этом только 51 из них для junior-специалистов, что свидетельствует о заинтересованности работодателей в опытных сотрудниках. Cреднее количество ключевых навыков в вакансиях (более 6) также косвенно подтверждает этот тезис. Распределение количества вакансий в зависимости от опыта работы показывает, что наиболее востребованы кандидаты с опытом работы от 1 года и выше.
- Из 480 вакансий DS всего для 62 указан уровень зарплаты. Примечательно, что для соискателей с опытом работы более 6 лет, значение зарплаты не было указано ни в одной из вакансий. Можно сделать вывод, что в большинстве случаев предложение о зарплате формируется по результатам собеседования c кандидатами.

# Общий вывод по проекту

В БД содержится достаточное количество вакансий в различных сферах деятельности и предметных областях. География предложений работодателей обширная, включает в себя вакансии не только на территории России, но и в сопредельных государствах. Описание вакансий полное, что позволяет проводить анализ на основе названия вакансии, ключевых навыков, опыта работы, заработной платы, типа трудоустройства и графика работы (аналогично анализу вакансий для DS). Учитывая, что бОльшая часть работодателей в БД относится к сферам разработки ПО, системной интеграции и интернет-технологий, можно проводить детальный анализ вакансий для широкого круга IT-профессий.